<template>
    <div class="container">
        <h2>Приложение собрано в формате API</h2>
        <p>Все методы описанные в ТЗ работают через "/api/название метода"</p>
        <p>Моменты:</p>
        <ul>
            <li>
                Редактирование товаров и категорий происходит через метод PUT
            </li>
            <li>
                Не понял метод "/categories/{id}?includeProducts=1", поэтому
                пропустил
            </li>
            <li>
                На фронте много повторяющегося кода в компонентах, не делил его
                на подкомпоненты
            </li>
        </ul>
    </div>
</template>
